create_library_set -name min_time -timing {/home/install/FOUNDRY/digital/180nm/dig/lib/fast.lib}
create_library_set -name max_time -timing {/home/install/FOUNDRY/digital/180nm/dig/lib/slow.lib}
create_constraint_mode -name const -sdc_files {decoder2to4_sdc.sdc}
create_delay_corner -name min_delay -library_set {min_time}
create_delay_corner -name max_delay -library_set {max_time}
create_analysis_view -name worst -constraint_mode {const} -delay_corner {max_delay}
create_analysis_view -name best -constraint_mode {const} -delay_corner {min_delay}
set_analysis_view -setup {worst} -hold {best}
